const data = [
    {
        id: 1,
        title: 'Городской конкурс сочинений «Деды наших дедов – герои Отечества», посвященного 79-ой годовщине Победы советского народа в Великой Отечественной войне',
        tags: ['Журналист', 'Историк', 'Патриот', 'Юнармеец'],
        description: {
            aim: 'сохранение исторической памяти о подвиге и героизме советского народа в годы Великой Отечественной войны, о воинском и трудовом подвиге наших предков через личное осмысление, традиции и судьбы семей, хранящих светлую память о своих близких, через понимание роли нашей страны в избавлении от фашизма.',
            tasks: [
                '1воспитание патриотизма у учащихся;',
                'уважения к подвигу защитников Отечества;',
                'изучение исторического наследия России на примере подвига советского народа во время Великой Отечественной войны.'
            ],
            conditions: [
                '1Работы на Конкурс принимаются в электронном формате docx (формат А4, шрифт - Times New Roman, основной текст - кегль 14, интервал межстрочный – 1,5).',
                'Объем работы должен быть не более 4 (четырёх) печатных страниц основного текста.',
                'Первая страница – заполненная заявка (Тема работы (пункт 5 Положения); сведения об авторе: фамилия, имя, отчество, дата рождения, общеобразовательное учреждение, класс, руководитель (учитель помогающий в написании и структурировании работы), телефон и электронная почта руководителя.',
                'Работа должна содержать фотографию или фотографии родственника, о котором будет идти речь в сочинении, а также фотографию участника, руководителя и директора школы.'
            ],
            date: [
                '1Конкурс проводится в три этапа (школьный, районный, городской):',
                '1 этап (школьный): с 8 апреля по 3 мая 2024 года;',
                '2 этап (районный): с 6 по 13 мая 2024 года'
            ],
            end: 'Заявки необходимо прислать до 6 апреля 2024 года'
        },

        source: '#',
        source__text: 'ссылка_на_райт.ру',
        type: 'article',
        publication_date: '03.05.2024',
        hasParticipant: true
    },
    {
        id: 2,
        title: 'Городской конкурс сочинений «Деды наших дедов – герои Отечества», посвященного 79-ой годовщине Победы советского народа в Великой Отечественной войне',
        tags: ['Журналист', 'Патриот', 'Юнармеец'],
        description: {
            aim: 'сохранение исторической памяти о подвиге и героизме советского народа в годы Великой Отечественной войны, о воинском и трудовом подвиге наших предков через личное осмысление, традиции и судьбы семей, хранящих светлую память о своих близких, через понимание роли нашей страны в избавлении от фашизма.',
            tasks: [
                'воспитание патриотизма у учащихся;',
                'уважения к подвигу защитников Отечества;',
                'изучение исторического наследия России на примере подвига советского народа во время Великой Отечественной войны.'
            ],
            conditions: [
                'Работы на Конкурс принимаются в электронном формате docx (формат А4, шрифт - Times New Roman, основной текст - кегль 14, интервал межстрочный – 1,5).',
                'Объем работы должен быть не более 4 (четырёх) печатных страниц основного текста.',
                'Первая страница – заполненная заявка (Тема работы (пункт 5 Положения); сведения об авторе: фамилия, имя, отчество, дата рождения, общеобразовательное учреждение, класс, руководитель (учитель помогающий в написании и структурировании работы), телефон и электронная почта руководителя.',
                'Работа должна содержать фотографию или фотографии родственника, о котором будет идти речь в сочинении, а также фотографию участника, руководителя и директора школы.'
            ],
            date: [
                'Конкурс проводится в три этапа (школьный, районный, городской):',
                '1 этап (школьный): с 8 апреля по 3 мая 2024 года;',
                '2 этап (районный): с 6 по 13 мая 2024 года'
            ],
            end: 'Заявки необходимо прислать до 6 апреля 2024 года'
        },

        source: '#',
        source__text: 'ссылка_на_райт.ру',
        type: 'article',
        publication_date: '04.05.2024',
        hasParticipant: true
    },
    {
        id: 3,
        title: 'Городской конкурс сочинений «Деды наших дедов – герои Отечества», посвященного 79-ой годовщине Победы советского народа в Великой Отечественной войне',
        tags: ['Журналист', 'Историк'],
        description: {
            aim: 'сохранение исторической памяти о подвиге и героизме советского народа в годы Великой Отечественной войны, о воинском и трудовом подвиге наших предков через личное осмысление, традиции и судьбы семей, хранящих светлую память о своих близких, через понимание роли нашей страны в избавлении от фашизма.',
            tasks: [
                'воспитание патриотизма у учащихся;',
                'уважения к подвигу защитников Отечества;',
                'изучение исторического наследия России на примере подвига советского народа во время Великой Отечественной войны.'
            ],
            conditions: [
                'Работы на Конкурс принимаются в электронном формате docx (формат А4, шрифт - Times New Roman, основной текст - кегль 14, интервал межстрочный – 1,5).',
                'Объем работы должен быть не более 4 (четырёх) печатных страниц основного текста.',
                'Первая страница – заполненная заявка (Тема работы (пункт 5 Положения); сведения об авторе: фамилия, имя, отчество, дата рождения, общеобразовательное учреждение, класс, руководитель (учитель помогающий в написании и структурировании работы), телефон и электронная почта руководителя.',
                'Работа должна содержать фотографию или фотографии родственника, о котором будет идти речь в сочинении, а также фотографию участника, руководителя и директора школы.'
            ],
            date: [
                'Конкурс проводится в три этапа (школьный, районный, городской):',
                '1 этап (школьный): с 8 апреля по 3 мая 2024 года;',
                '2 этап (районный): с 6 по 13 мая 2024 года'
            ],
            end: 'Заявки необходимо прислать до 6 апреля 2024 года'
        },

        source: '#',
        source__text: 'ссылка_на_райт.ру',
        type: 'article',
        publication_date: '05.05.2024',
        hasParticipant: false
    },
    {
        id: 4,
        title: 'Городской конкурс сочинений «Деды наших дедов – герои Отечества», посвященного 79-ой годовщине Победы советского народа в Великой Отечественной войне',
        tags: ['Журналист'],
        description: {
            aim: 'сохранение исторической памяти о подвиге и героизме советского народа в годы Великой Отечественной войны, о воинском и трудовом подвиге наших предков через личное осмысление, традиции и судьбы семей, хранящих светлую память о своих близких, через понимание роли нашей страны в избавлении от фашизма.',
            tasks: [
                'воспитание патриотизма у учащихся;',
                'уважения к подвигу защитников Отечества;',
                'изучение исторического наследия России на примере подвига советского народа во время Великой Отечественной войны.'
            ],
            conditions: [
                'Работы на Конкурс принимаются в электронном формате docx (формат А4, шрифт - Times New Roman, основной текст - кегль 14, интервал межстрочный – 1,5).',
                'Объем работы должен быть не более 4 (четырёх) печатных страниц основного текста.',
                'Первая страница – заполненная заявка (Тема работы (пункт 5 Положения); сведения об авторе: фамилия, имя, отчество, дата рождения, общеобразовательное учреждение, класс, руководитель (учитель помогающий в написании и структурировании работы), телефон и электронная почта руководителя.',
                'Работа должна содержать фотографию или фотографии родственника, о котором будет идти речь в сочинении, а также фотографию участника, руководителя и директора школы.'
            ],
            date: [
                'Конкурс проводится в три этапа (школьный, районный, городской):',
                '1 этап (школьный): с 8 апреля по 3 мая 2024 года;',
                '2 этап (районный): с 6 по 13 мая 2024 года'
            ],
            end: 'Заявки необходимо прислать до 6 апреля 2024 года'
        },

        source: '#',
        source__text: 'ссылка_на_райт.ру',
        type: 'article',
        publication_date: '06.05.2024',
        hasParticipant: true
    },
    {
        id: 5,
        title: 'Городской конкурс сочинений «Деды наших дедов – герои Отечества», посвященного 79-ой годовщине Победы советского народа в Великой Отечественной войне',
        tags: ['Журналист', 'Историк', 'Патриот', 'Юнармеец'],
        description: {
            aim: 'сохранение исторической памяти о подвиге и героизме советского народа в годы Великой Отечественной войны, о воинском и трудовом подвиге наших предков через личное осмысление, традиции и судьбы семей, хранящих светлую память о своих близких, через понимание роли нашей страны в избавлении от фашизма.',
            tasks: [
                'воспитание патриотизма у учащихся;',
                'уважения к подвигу защитников Отечества;',
                'изучение исторического наследия России на примере подвига советского народа во время Великой Отечественной войны.'
            ],
            conditions: [
                'Работы на Конкурс принимаются в электронном формате docx (формат А4, шрифт - Times New Roman, основной текст - кегль 14, интервал межстрочный – 1,5).',
                'Объем работы должен быть не более 4 (четырёх) печатных страниц основного текста.',
                'Первая страница – заполненная заявка (Тема работы (пункт 5 Положения); сведения об авторе: фамилия, имя, отчество, дата рождения, общеобразовательное учреждение, класс, руководитель (учитель помогающий в написании и структурировании работы), телефон и электронная почта руководителя.',
                'Работа должна содержать фотографию или фотографии родственника, о котором будет идти речь в сочинении, а также фотографию участника, руководителя и директора школы.'
            ],
            date: [
                'Конкурс проводится в три этапа (школьный, районный, городской):',
                '1 этап (школьный): с 8 апреля по 3 мая 2024 года;',
                '2 этап (районный): с 6 по 13 мая 2024 года'
            ],
            end: 'Заявки необходимо прислать до 6 апреля 2024 года'
        },

        source: '#',
        source__text: 'ссылка_на_райт.ру',
        type: 'article',
        publication_date: '07.05.2024',
        hasParticipant: false
    },
    {
        id: 6,
        title: 'Городской конкурс сочинений «Деды наших дедов – герои Отечества», посвященного 79-ой годовщине Победы советского народа в Великой Отечественной войне',
        tags: ['Журналист', 'Историк', 'Патриот', 'Юнармеец'],
        description: {
            aim: 'сохранение исторической памяти о подвиге и героизме советского народа в годы Великой Отечественной войны, о воинском и трудовом подвиге наших предков через личное осмысление, традиции и судьбы семей, хранящих светлую память о своих близких, через понимание роли нашей страны в избавлении от фашизма.',
            tasks: [
                'воспитание патриотизма у учащихся;',
                'уважения к подвигу защитников Отечества;',
                'изучение исторического наследия России на примере подвига советского народа во время Великой Отечественной войны.'
            ],
            conditions: [
                'Работы на Конкурс принимаются в электронном формате docx (формат А4, шрифт - Times New Roman, основной текст - кегль 14, интервал межстрочный – 1,5).',
                'Объем работы должен быть не более 4 (четырёх) печатных страниц основного текста.',
                'Первая страница – заполненная заявка (Тема работы (пункт 5 Положения); сведения об авторе: фамилия, имя, отчество, дата рождения, общеобразовательное учреждение, класс, руководитель (учитель помогающий в написании и структурировании работы), телефон и электронная почта руководителя.',
                'Работа должна содержать фотографию или фотографии родственника, о котором будет идти речь в сочинении, а также фотографию участника, руководителя и директора школы.'
            ],
            date: [
                'Конкурс проводится в три этапа (школьный, районный, городской):',
                '1 этап (школьный): с 8 апреля по 3 мая 2024 года;',
                '2 этап (районный): с 6 по 13 мая 2024 года'
            ],
            end: 'Заявки необходимо прислать до 6 апреля 2024 года'
        },

        source: '#',
        source__text: 'ссылка_на_райт.ру',
        type: 'article',
        publication_date: '08.05.2024',
        hasParticipant: false
    },
    {
        id: 7,
        title: 'Городской конкурс сочинений «Деды наших дедов – герои Отечества», посвященного 79-ой годовщине Победы советского народа в Великой Отечественной войне',
        tags: ['Журналист', 'Историк', 'Патриот', 'Юнармеец'],
        description: {
            aim: 'сохранение исторической памяти о подвиге и героизме советского народа в годы Великой Отечественной войны, о воинском и трудовом подвиге наших предков через личное осмысление, традиции и судьбы семей, хранящих светлую память о своих близких, через понимание роли нашей страны в избавлении от фашизма.',
            tasks: [
                'воспитание патриотизма у учащихся;',
                'уважения к подвигу защитников Отечества;',
                'изучение исторического наследия России на примере подвига советского народа во время Великой Отечественной войны.'
            ],
            conditions: [
                'Работы на Конкурс принимаются в электронном формате docx (формат А4, шрифт - Times New Roman, основной текст - кегль 14, интервал межстрочный – 1,5).',
                'Объем работы должен быть не более 4 (четырёх) печатных страниц основного текста.',
                'Первая страница – заполненная заявка (Тема работы (пункт 5 Положения); сведения об авторе: фамилия, имя, отчество, дата рождения, общеобразовательное учреждение, класс, руководитель (учитель помогающий в написании и структурировании работы), телефон и электронная почта руководителя.',
                'Работа должна содержать фотографию или фотографии родственника, о котором будет идти речь в сочинении, а также фотографию участника, руководителя и директора школы.'
            ],
            date: [
                'Конкурс проводится в три этапа (школьный, районный, городской):',
                '1 этап (школьный): с 8 апреля по 3 мая 2024 года;',
                '2 этап (районный): с 6 по 13 мая 2024 года'
            ],
            end: 'Заявки необходимо прислать до 6 апреля 2024 года'
        },

        source: '#',
        source__text: 'ссылка_на_райт.ру',
        type: 'article',
        publication_date: '08.05.2024',
        hasParticipant: true
    },
    {
        id: 8,
        title: 'Городской конкурс сочинений «Деды наших дедов – герои Отечества», посвященного 79-ой годовщине Победы советского народа в Великой Отечественной войне',
        tags: ['Журналист', 'Историк', 'Патриот', 'Юнармеец'],
        description: {
            aim: 'сохранение исторической памяти о подвиге и героизме советского народа в годы Великой Отечественной войны, о воинском и трудовом подвиге наших предков через личное осмысление, традиции и судьбы семей, хранящих светлую память о своих близких, через понимание роли нашей страны в избавлении от фашизма.',
            tasks: [
                'воспитание патриотизма у учащихся;',
                'уважения к подвигу защитников Отечества;',
                'изучение исторического наследия России на примере подвига советского народа во время Великой Отечественной войны.'
            ],
            conditions: [
                'Работы на Конкурс принимаются в электронном формате docx (формат А4, шрифт - Times New Roman, основной текст - кегль 14, интервал межстрочный – 1,5).',
                'Объем работы должен быть не более 4 (четырёх) печатных страниц основного текста.',
                'Первая страница – заполненная заявка (Тема работы (пункт 5 Положения); сведения об авторе: фамилия, имя, отчество, дата рождения, общеобразовательное учреждение, класс, руководитель (учитель помогающий в написании и структурировании работы), телефон и электронная почта руководителя.',
                'Работа должна содержать фотографию или фотографии родственника, о котором будет идти речь в сочинении, а также фотографию участника, руководителя и директора школы.'
            ],
            date: [
                'Конкурс проводится в три этапа (школьный, районный, городской):',
                '1 этап (школьный): с 8 апреля по 3 мая 2024 года;',
                '2 этап (районный): с 6 по 13 мая 2024 года'
            ],
            end: 'Заявки необходимо прислать до 6 апреля 2024 года'
        },

        source: '#',
        source__text: 'ссылка_на_райт.ру',
        type: 'article',
        publication_date: '08.05.2024',
        hasParticipant: false
    },
    {
        id: 9,
        title: 'Городской конкурс сочинений «Деды наших дедов – герои Отечества», посвященного 79-ой годовщине Победы советского народа в Великой Отечественной войне',
        tags: ['Журналист', 'Историк', 'Патриот', 'Юнармеец'],
        description: {
            aim: 'сохранение исторической памяти о подвиге и героизме советского народа в годы Великой Отечественной войны, о воинском и трудовом подвиге наших предков через личное осмысление, традиции и судьбы семей, хранящих светлую память о своих близких, через понимание роли нашей страны в избавлении от фашизма.',
            tasks: [
                'воспитание патриотизма у учащихся;',
                'уважения к подвигу защитников Отечества;',
                'изучение исторического наследия России на примере подвига советского народа во время Великой Отечественной войны.'
            ],
            conditions: [
                'Работы на Конкурс принимаются в электронном формате docx (формат А4, шрифт - Times New Roman, основной текст - кегль 14, интервал межстрочный – 1,5).',
                'Объем работы должен быть не более 4 (четырёх) печатных страниц основного текста.',
                'Первая страница – заполненная заявка (Тема работы (пункт 5 Положения); сведения об авторе: фамилия, имя, отчество, дата рождения, общеобразовательное учреждение, класс, руководитель (учитель помогающий в написании и структурировании работы), телефон и электронная почта руководителя.',
                'Работа должна содержать фотографию или фотографии родственника, о котором будет идти речь в сочинении, а также фотографию участника, руководителя и директора школы.'
            ],
            date: [
                'Конкурс проводится в три этапа (школьный, районный, городской):',
                '1 этап (школьный): с 8 апреля по 3 мая 2024 года;',
                '2 этап (районный): с 6 по 13 мая 2024 года'
            ],
            end: 'Заявки необходимо прислать до 6 апреля 2024 года'
        },

        source: '#',
        source__text: 'ссылка_на_райт.ру',
        type: 'article',
        publication_date: '09.05.2024',
        hasParticipant: false
    },
    {
        id: 10,
        title: 'Городской конкурс сочинений «Деды наших дедов – герои Отечества», посвященного 79-ой годовщине Победы советского народа в Великой Отечественной войне',
        tags: ['Журналист', 'Историк', 'Патриот', 'Юнармеец'],
        description: {
            aim: 'сохранение исторической памяти о подвиге и героизме советского народа в годы Великой Отечественной войны, о воинском и трудовом подвиге наших предков через личное осмысление, традиции и судьбы семей, хранящих светлую память о своих близких, через понимание роли нашей страны в избавлении от фашизма.',
            tasks: [
                'воспитание патриотизма у учащихся;',
                'уважения к подвигу защитников Отечества;',
                'изучение исторического наследия России на примере подвига советского народа во время Великой Отечественной войны.'
            ],
            conditions: [
                'Работы на Конкурс принимаются в электронном формате docx (формат А4, шрифт - Times New Roman, основной текст - кегль 14, интервал межстрочный – 1,5).',
                'Объем работы должен быть не более 4 (четырёх) печатных страниц основного текста.',
                'Первая страница – заполненная заявка (Тема работы (пункт 5 Положения); сведения об авторе: фамилия, имя, отчество, дата рождения, общеобразовательное учреждение, класс, руководитель (учитель помогающий в написании и структурировании работы), телефон и электронная почта руководителя.',
                'Работа должна содержать фотографию или фотографии родственника, о котором будет идти речь в сочинении, а также фотографию участника, руководителя и директора школы.'
            ],
            date: [
                'Конкурс проводится в три этапа (школьный, районный, городской):',
                '1 этап (школьный): с 8 апреля по 3 мая 2024 года;',
                '2 этап (районный): с 6 по 13 мая 2024 года'
            ],
            end: 'Заявки необходимо прислать до 6 апреля 2024 года'
        },

        source: '#',
        source__text: 'ссылка_на_райт.ру',
        type: 'article',
        publication_date: '03.05.2024',
        hasParticipant: true
    }
]

export function getById(id) {
    return data.filter((el) => {
        return el.id === id
    })
}

export function getSiblingCard(id) {
    let index = data.findIndex((el) => isId(el, id))
    let prev = data[index - 1]?.id
    let next = data[index + 1]?.id

    if (!prev) {
        prev = data[data.findLastIndex((el) => el)]?.id
    }
    if (!next) {
        next = data[0].id
    }
    return { prevId: prev, nextId: next }
}

function isId(el, id) {
    return el.id === id
}

export function randomArticle(id, count) {
    const idArr = [id]
    const arrContnent = []

    while (arrContnent.length < count) {
        let randomIndex = Math.floor(Math.random() * data.length)
        if (!idArr.includes(randomIndex)) {
            idArr.push(randomIndex)
            arrContnent.push(data[randomIndex])
        }
    }
    return arrContnent
}

export function getAll() {
    return data
}
