<template>
    <section class="section-notification">
        <div class="notification-panel-wraper">
            <div class="notification-panel__container">
                <div class="notification-panel">
                    <DropdownComponent
                        v-model:modelValue="sort"
                        class="notification-panel__dropdown-sort"
                        :options="notificationSort"
                    />
                    <svg
                        class="notification-panel__coin"
                        width="277" 
                        height="105" 
                        viewBox="0 0 277 105" 
                        fill="none" 
                        xmlns="http://www.w3.org/2000/svg"
                    >
                        <path 
                            d="M104.451 18.1682C105.18 16.2593 106.32 14.5274 107.874 12.9716L107.875 12.9701L108.281 12.563C109.663 11.18 111.278 10.1281 113.126 9.40761C114.975 8.68629 116.872 8.30987 118.819 8.27752C120.766 8.24545 122.663 8.557 124.511 9.2133C126.358 9.8696 127.984 10.8957 129.387 12.2917C130.298 13.198 131.122 14.2893 131.86 15.5646C132.598 16.8408 133.108 18.1602 133.391 19.5236C133.673 20.8876 133.672 22.2522 133.387 23.6179C133.103 24.9842 132.418 26.2101 131.332 27.2967C130.74 27.8895 130.05 28.3724 129.261 28.744C128.472 29.1159 127.665 29.3469 126.84 29.4362C126.014 29.5261 125.2 29.4432 124.4 29.1884C123.599 28.9331 122.879 28.4874 122.239 27.8505C121.698 27.312 121.297 26.7053 121.039 26.0298C120.781 25.3545 120.652 24.6727 120.652 23.9842C120.653 23.296 120.795 22.6128 121.079 21.9353C121.363 21.2578 121.764 20.6598 122.282 20.1413C122.849 19.5735 123.503 19.1163 124.242 18.7684C124.982 18.422 125.74 18.2034 126.516 18.1137C127.292 18.0249 128.044 18.0831 128.77 18.2894C129.497 18.4954 130.144 18.8801 130.71 19.4433C130.956 19.6884 131.19 19.9946 131.411 20.3626C131.363 19.7236 131.222 19.1644 130.988 18.6861C130.754 18.2073 130.453 17.7843 130.084 17.4171C129.099 16.4377 127.83 15.9143 126.278 15.8469C125.367 15.826 124.448 15.9712 123.524 16.2824C122.6 16.5936 121.706 16.9968 120.843 17.4921C119.981 17.9873 119.173 18.5376 118.421 19.143C117.669 19.749 117.022 20.323 116.479 20.8666C115.542 21.8046 114.66 22.9082 113.833 24.1786C113.007 25.4484 112.39 26.7911 111.982 28.207C111.574 29.6226 111.469 31.0188 111.664 32.3948C111.86 33.771 112.524 35.0225 113.657 36.1494C114.47 36.9577 115.406 37.519 116.465 37.8346C117.524 38.1496 118.571 38.0349 119.607 37.4896C119.115 36.9999 118.917 36.4722 119.017 35.9063C119.115 35.3399 119.374 34.8471 119.794 34.4274C120.238 33.9826 120.774 33.7039 121.402 33.5908C122.031 33.477 122.592 33.6656 123.084 34.1556C123.798 34.8656 124.136 35.6452 124.098 36.4935C124.061 37.3421 123.734 38.0754 123.117 38.6927C121.983 39.5826 120.787 40.0915 119.531 40.2197C118.273 40.3479 116.998 40.1991 115.705 39.7742C114.412 39.3491 113.131 38.7032 111.863 37.8353C110.594 36.9676 109.394 35.9703 108.262 34.8438C106.735 33.3255 105.56 31.6272 104.736 29.7496C103.913 27.8717 103.477 25.9493 103.429 23.9826C103.382 22.0151 103.722 20.0774 104.451 18.1682Z" 
                            fill="#434C59"
                        />
                        <path 
                            fill-rule="evenodd" 
                            clip-rule="evenodd" 
                            d="M134.18 39.0554C125.356 47.8896 111.03 47.9162 102.182 39.1148C93.3346 30.3134 93.3151 16.0169 102.139 7.18266C110.963 -1.65155 125.288 -1.67814 134.136 7.12328C142.984 15.9247 143.004 30.2212 134.18 39.0554ZM133.277 38.1576C124.951 46.4941 111.432 46.5192 103.083 38.2136C94.7332 29.908 94.7148 16.417 103.041 8.08048C111.368 -0.256029 124.887 -0.28112 133.236 8.02445C141.585 16.33 141.604 29.8211 133.277 38.1576Z" 
                            fill="#434C59"
                        />
                        <path 
                            d="M16.3581 88.8613C14.7967 88.508 13.3268 87.8155 11.9477 86.783L11.9466 86.7829L11.5856 86.5127C10.3597 85.5949 9.36462 84.4591 8.60062 83.1052C7.83599 81.7517 7.33345 80.3219 7.09223 78.8154C6.85127 77.3091 6.88235 75.8035 7.18624 74.2975C7.4902 72.792 8.10561 71.4173 9.03252 70.1739C9.63427 69.3667 10.3891 68.6064 11.2963 67.8922C12.2042 67.1782 13.1709 66.6364 14.197 66.2661C15.2235 65.8957 16.2819 65.7451 17.3728 65.8144C18.464 65.8831 19.4908 66.2784 20.454 66.9995C20.9795 67.3929 21.4306 67.8745 21.8064 68.4451C22.1824 69.0158 22.4512 69.6165 22.612 70.2464C22.7734 70.8771 22.7994 71.517 22.6907 72.1661C22.5815 72.8153 22.3158 73.4234 21.8929 73.9906C21.5353 74.4703 21.1093 74.8482 20.614 75.1233C20.1189 75.3985 19.6045 75.5742 19.0704 75.6502C18.5365 75.7259 17.9909 75.6917 17.434 75.5468C16.877 75.4018 16.3687 75.1572 15.9091 74.8131C15.4058 74.4363 14.9786 73.9801 14.6267 73.445C14.276 72.91 14.0222 72.3462 13.8665 71.7542C13.7115 71.1619 13.6732 70.5728 13.7526 69.9863C13.8316 69.3996 14.0583 68.8556 14.4322 68.354C14.595 68.1357 14.8065 67.9205 15.0673 67.7078C14.5771 67.8162 14.159 67.9877 13.814 68.222C13.4687 68.4569 13.1741 68.7376 12.9303 69.0646C12.28 69.9369 12.0148 70.9789 12.1349 72.1905C12.2198 72.8996 12.4344 73.5956 12.7784 74.278C13.1223 74.9603 13.5342 75.6085 14.0141 76.2229C14.494 76.8369 15.0104 77.4019 15.5634 77.9182C16.1169 78.4341 16.6339 78.8721 17.1157 79.2329C17.9471 79.8553 18.901 80.417 19.9781 80.9173C21.0546 81.4172 22.1645 81.7468 23.3079 81.906C24.451 82.065 25.5456 81.9921 26.5911 81.6875C27.6367 81.3828 28.5336 80.7288 29.2818 79.7251C29.8185 79.0052 30.15 78.2172 30.2772 77.3608C30.4039 76.504 30.1987 75.7045 29.6609 74.9621C29.3357 75.3982 28.9483 75.6098 28.4984 75.5956C28.0482 75.5818 27.6372 75.4356 27.2652 75.1571C26.8709 74.8619 26.5952 74.4768 26.4377 74.0022C26.2797 73.5273 26.3638 73.0717 26.6891 72.6352C27.1605 72.0029 27.7276 71.6542 28.3897 71.589C29.0521 71.524 29.6571 71.6964 30.2043 72.1061C31.0205 72.8872 31.5478 73.7578 31.7867 74.7182C32.0257 75.679 32.0518 76.6843 31.8659 77.7345C31.6796 78.7846 31.3209 79.8498 30.7885 80.9296C30.2564 82.01 29.6162 83.0513 28.8682 84.0547C27.8601 85.407 26.6733 86.5071 25.3086 87.3545C23.9435 88.2017 22.501 88.7529 20.981 89.0082C19.4603 89.2634 17.9197 89.2144 16.3581 88.8613Z" 
                            fill="#434C59"
                        />
                        <path 
                            fill-rule="evenodd" 
                            clip-rule="evenodd" 
                            d="M29.2576 63.4859C37.0886 69.3487 38.6994 80.4564 32.8554 88.2955C27.0114 96.1346 15.9256 97.7367 8.09463 91.8738C0.263622 86.0109 -1.34717 74.9033 4.49684 67.0642C10.3408 59.2251 21.4266 57.623 29.2576 63.4859ZM28.6615 64.2855C36.0513 69.8181 37.5714 80.3 32.0566 87.6974C26.5418 95.0949 16.0806 96.6067 8.69077 91.0741C1.30094 85.5416 -0.2191 75.0597 5.29567 67.6622C10.8104 60.2648 21.2717 58.753 28.6615 64.2855Z" 
                            fill="#434C59"
                        />
                        <path 
                            d="M227.577 82.4209C226.391 79.8689 225.776 77.08 225.731 74.052L225.73 74.0504L225.718 73.2579C225.678 70.5663 226.189 67.9618 227.252 65.4445C228.314 62.9266 229.763 60.6915 231.6 58.7376C233.437 56.7842 235.565 55.2101 237.987 54.0151C240.408 52.8207 242.982 52.2002 245.708 52.1542C247.477 52.1243 249.346 52.3578 251.314 52.8528C253.283 53.3489 255.075 54.1119 256.692 55.1416C258.31 56.1719 259.657 57.4828 260.732 59.075C261.809 60.6671 262.362 62.5202 262.393 64.635C262.411 65.7888 262.225 66.9338 261.835 68.0695C261.445 69.2058 260.898 70.225 260.194 71.1254C259.49 72.0275 258.628 72.751 257.608 73.2971C256.587 73.8426 255.456 74.1261 254.212 74.147C253.161 74.1648 252.177 73.978 251.263 73.5844C250.348 73.1913 249.551 72.6643 248.871 72.0028C248.193 71.3413 247.654 70.5456 247.257 69.6149C246.861 68.6843 246.655 67.7144 246.64 66.7052C246.624 65.6002 246.799 64.5158 247.166 63.4514C247.533 62.3887 248.045 61.43 248.702 60.5774C249.359 59.7254 250.138 59.0394 251.039 58.5197C251.94 57.9995 252.941 57.7304 254.04 57.7118C254.519 57.7038 255.045 57.7669 255.621 57.9013C254.944 57.3357 254.256 56.9383 253.56 56.71C252.862 56.4818 252.155 56.3734 251.438 56.3855C249.526 56.4178 247.791 57.1683 246.235 58.6369C245.339 59.5167 244.601 60.563 244.021 61.7745C243.442 62.986 242.982 64.2554 242.643 65.5832C242.304 66.9104 242.073 68.2358 241.948 69.5599C241.825 70.884 241.771 72.0739 241.787 73.1318C241.814 74.9573 242.057 76.8877 242.518 78.9237C242.979 80.9586 243.713 82.8569 244.72 84.6187C245.726 86.3799 247.004 87.8245 248.55 88.9519C250.098 90.0793 251.971 90.6247 254.171 90.5875C255.749 90.5609 257.202 90.1755 258.53 89.4325C259.858 88.6884 260.75 87.5442 261.205 85.9983C260.249 86.0144 259.539 85.7027 259.075 85.0614C258.611 84.4202 258.373 83.6914 258.36 82.8745C258.348 82.0089 258.587 81.2116 259.078 80.4827C259.569 79.7527 260.294 79.3802 261.25 79.3641C262.637 79.3407 263.731 79.7551 264.533 80.6063C265.335 81.458 265.745 82.4849 265.763 83.6863C265.553 85.661 264.908 87.3299 263.828 88.694C262.748 90.0586 261.378 91.1749 259.717 92.0444C258.056 92.9133 256.188 93.5585 254.114 93.9776C252.039 94.3979 249.903 94.6258 247.703 94.6629C244.739 94.713 241.933 94.2437 239.288 93.2551C236.643 92.266 234.327 90.8511 232.339 89.0106C230.35 87.1689 228.763 84.9729 227.577 82.4209Z" 
                            fill="#434C59"
                        />
                        <path 
                            fill-rule="evenodd" 
                            clip-rule="evenodd" 
                            d="M276.739 73.1092C276.994 90.3026 263.271 104.476 246.086 104.766C228.902 105.056 214.764 91.3534 214.509 74.1599C214.254 56.9665 227.977 42.7932 245.162 42.5031C262.346 42.2129 276.484 55.9157 276.739 73.1092ZM274.986 73.1388C275.227 89.3636 262.276 102.738 246.06 103.012C229.844 103.286 216.503 90.3551 216.262 74.1303C216.021 57.9055 228.972 44.5308 245.188 44.257C261.404 43.9831 274.745 56.914 274.986 73.1388Z" 
                            fill="#434C59"
                        />
                    </svg>
                </div>
            </div>
        </div>
        <div class="notification-wpaper">
            <div class="notification-container">
                <div class="notification-contnent">
                    <div
                        v-if="notifications.length > 0"
                        class="notification-list"
                    >
                        <div
                            v-for="el in renderList"
                            :key="el.id"
                            class="notification__item"
                        > 
                            <div class="notification__info">
                                <p class="notification__publication p2">
                                    {{ el.notification_date }}
                                </p>
                            </div>
                            <p 
                                class="notification__decription h3"
                                :class="{'active': readNotification.includes(el.id)}"
                                @click="activeMenu(el.id)"
                            >
                                {{ el.message }}
                            </p>
                        </div>
                    </div>
                    <p
                        v-else
                        class="p1 notification-contnent-empty"
                    >
                        Здесь отображаются уведомления, уведомлений пока нет
                    </p>
                </div>
            </div>
            <PaginationComponent
                :perpage="6"
                :data="notifications"
                :color="{ main: '#1F2A3E', hover: '#dda06b' }"
                @set-list="getRenderList"
            />
        </div>
    </section>
</template>
<script setup>
import { ref } from 'vue';
import PaginationComponent from '@/components/pagination/PaginationComponent.vue';
import DropdownComponent from '@/components/dropdown/DropdownComponent.vue';

const renderList = ref([])
const sort = ref([])

const readNotification = ref([]);

function activeMenu (id){
    if (!readNotification.value.includes(id)) {
        readNotification.value.push(id)
    }
}

const notifications = [
    {
        id: 1,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 2,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "03.03.2024",
    },
    {
        id: 3,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "04.03.2024",
    },
    {
        id: 4,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 5,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 6,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 7,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 8,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 9,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 10,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 11,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 12,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 13,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 14,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 15,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 16,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 17,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
    {
        id: 18,
        message: "Иванов Генадий Михайлович, 6б класс, подал заявку на наставничество в конкурсе «Деды наших дедов – герои Отечества».",
        notification_date: "02.03.2024",
    },
];


const notificationSort = [
    'Новые вверху',
    'Cтарые вверху',
]

function getRenderList (list) {
    console.log(list);
    renderList.value = list
}
</script>

<style lang="scss">

.section-notification {
    display: flex;
    flex-direction: column;
    flex-grow: 1;
}

.notification-panel-wraper {
    width: 100%;
    background: var(--dark);
}

.notification-panel__container {
    max-width: 1560px;
    margin: auto;
    position: relative;
}

.notification-panel {
    max-width: 1560px;
    padding: 48px 60px;
    margin: auto;
    position: relative;
    box-sizing: border-box;

    .dropdown-selected-text {
        min-width: 107px;
    }
    
    @media(max-width: $md) {
        padding: 48px 40px;
    }
    @media(max-width: 390px) {
        padding: 48px 16px;
        
        .notification-panel__dropdown-sort {
            max-width: 100%;
            width: 100%;

            .dropdown-selected {
                max-width: 100%;
                width: 100%;
            }
        }
    }
}
.notification-panel__coin {
    position: absolute;
    height: 120px;
    position: absolute;
    bottom: 10px;
    right: 620px;
    @media (max-width: $xxl) {
        right: 365px;
    }
    @media (max-width: $xl) {
        right: 120px;
    }
    @media (max-width: $lg) {
        right: 60px;
    }
    @media (max-width: $md) {
        right: 40px;
    }
    @media (max-width: 390px) {
        display: none;
    }
}

.notification-wpaper {
    flex-grow: 1;
    background: var(--white);
}

.notification-container {
    max-width: 1560px;
    padding: 24px 60px 20px 60px;
    margin: 0 auto;
    box-sizing: border-box;

    @media(max-width: 991px) {
        padding: 24px 40px;
    }

    @media(max-width: 576px) {
        padding: 24px 16px;
    }

    @media(max-width: 390px) {
        padding: 24px 0;
    }
}

.notification-contnent {
    display: flex;
    flex-direction: column;
    position: relative;
    gap: 24px;
    margin-bottom: 24px;
}

.notification-list {
    display: flex;
    flex-direction: column;
    gap: 16px;
}

.notification__item {
    display: flex;
    align-items: center;
    padding: 16px;
    border-bottom: 2px solid var(--roseBege);
    gap: 16px;

    &:hover {
        background: var(--lightBege)
    }

    @media(max-width: $sm) {
        flex-direction: column;
        align-items: flex-start;
    }
}

.notification__decription {
    cursor: pointer;

    &.active{
        font-weight: 400;
        font-size: 20px;
        line-height: 30px;
    }
}

.notification__publication {
    text-align: center;
}

</style>